garyPenhook/PIC-Assembler/device_includes/pic16f17525.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0091h
// bitfield definitions
PIR5_TX2IF_POSN                          equ 0000h
PIR5_TX2IF_POSITION                      equ 0000h
PIR5_TX2IF_SIZE                          equ 0001h
PIR5_TX2IF_LENGTH                        equ 0001h
PIR5_TX2IF_MASK                          equ 0001h
PIR5_RC2IF_POSN                          equ 0001h
PIR5_RC2IF_POSITION                      equ 0001h
PIR5_RC2IF_SIZE                          equ 0001h
PIR5_RC2IF_LENGTH                        equ 0001h
PIR5_RC2IF_MASK                          equ 0002h
PIR5_SSP1IF_POSN                         equ 0002h
PIR5_SSP1IF_POSITION                     equ 0002h
PIR5_SSP1IF_SIZE                         equ 0001h
PIR5_SSP1IF_LENGTH                       equ 0001h
PIR5_SSP1IF_MASK                         equ 0004h
PIR5_BCL1IF_POSN                         equ 0003h
PIR5_BCL1IF_POSITION                     equ 0003h
PIR5_BCL1IF_SIZE                         equ 0001h
PIR5_BCL1IF_LENGTH                       equ 0001h
PIR5_BCL1IF_MASK                         equ 0008h
PIR5_SSP2IF_POSN                         equ 0004h
PIR5_SSP2IF_POSITION                     equ 0004h
PIR5_SSP2IF_SIZE                         equ 0001h
PIR5_SSP2IF_LENGTH                       equ 0001h
PIR5_SSP2IF_MASK                         equ 0010h
PIR5_BCL2IF_POSN                         equ 0005h
PIR5_BCL2IF_POSITION                     equ 0005h
PIR5_BCL2IF_SIZE                         equ 0001h
PIR5_BCL2IF_LENGTH                       equ 0001h
PIR5_BCL2IF_MASK                         equ 0020h
PIR5_CM1IF_POSN                          equ 0006h
PIR5_CM1IF_POSITION                      equ 0006h
PIR5_CM1IF_SIZE                          equ 0001h
PIR5_CM1IF_LENGTH                        equ 0001h
PIR5_CM1IF_MASK                          equ 0040h
PIR5_CMLP1IF_POSN                        equ 0007h
PIR5_CMLP1IF_POSITION                    equ 0007h
PIR5_CMLP1IF_SIZE                        equ 0001h
PIR5_CMLP1IF_LENGTH                      equ 0001h
PIR5_CMLP1IF_MASK                        equ 0080h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 0092h
// bitfield definitions
PIR6_ADIF_POSN                           equ 0000h
PIR6_ADIF_POSITION                       equ 0000h
PIR6_ADIF_SIZE                           equ 0001h
PIR6_ADIF_LENGTH                         equ 0001h
PIR6_ADIF_MASK                           equ 0001h
PIR6_ADTIF_POSN                          equ 0001h
PIR6_ADTIF_POSITION                      equ 0001h
PIR6_ADTIF_SIZE                          equ 0001h
PIR6_ADTIF_LENGTH                        equ 0001h
PIR6_ADTIF_MASK                          equ 0002h
PIR6_ZCDIF_POSN                          equ 0002h
PIR6_ZCDIF_POSITION                      equ 0002h
PIR6_ZCDIF_SIZE                          equ 0001h
PIR6_ZCDIF_LENGTH                        equ 0001h
PIR6_ZCDIF_MASK                          equ 0004h
PIR6_IOCSRIF_POSN                        equ 0007h
PIR6_IOCSRIF_POSITION                    equ 0007h
PIR6_IOCSRIF_SIZE                        equ 0001h
PIR6_IOCSRIF_LENGTH                      equ 0001h
PIR6_IOCSRIF_MASK                        equ 0080h

// Register: PIR7
#define PIR7 PIR7
PIR7                                     equ 0093h
// bitfield definitions
PIR7_OPA1CIF_POSN                        equ 0000h
PIR7_OPA1CIF_POSITION                    equ 0000h
PIR7_OPA1CIF_SIZE                        equ 0001h
PIR7_OPA1CIF_LENGTH                      equ 0001h
PIR7_OPA1CIF_MASK                        equ 0001h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 0096h
// bitfield definitions
PIE0_INTE_POSN                           equ 0000h
PIE0_INTE_POSITION                       equ 0000h
PIE0_INTE_SIZE                           equ 0001h
PIE0_INTE_LENGTH                         equ 0001h
PIE0_INTE_MASK                           equ 0001h
PIE0_IOCIE_POSN                          equ 0004h
PIE0_IOCIE_POSITION                      equ 0004h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0010h
PIE0_TMR0IE_POSN                         equ 0005h
PIE0_TMR0IE_POSITION                     equ 0005h
PIE0_TMR0IE_SIZE                         equ 0001h
PIE0_TMR0IE_LENGTH                       equ 0001h
PIE0_TMR0IE_MASK                         equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0097h
// bitfield definitions
PIE1_NVMIE_POSN                          equ 0000h
PIE1_NVMIE_POSITION                      equ 0000h
PIE1_NVMIE_SIZE                          equ 0001h
PIE1_NVMIE_LENGTH                        equ 0001h
PIE1_NVMIE_MASK                          equ 0001h
PIE1_CRCIE_POSN                          equ 0001h
PIE1_CRCIE_POSITION                      equ 0001h
PIE1_CRCIE_SIZE                          equ 0001h
PIE1_CRCIE_LENGTH                        equ 0001h
PIE1_CRCIE_MASK                          equ 0002h
PIE1_SCANIE_POSN                         equ 0002h
PIE1_SCANIE_POSITION                     equ 0002h
PIE1_SCANIE_SIZE                         equ 0001h
PIE1_SCANIE_LENGTH                       equ 0001h
PIE1_SCANIE_MASK                         equ 0004h
PIE1_ACTIE_POSN                          equ 0003h
PIE1_ACTIE_POSITION                      equ 0003h
PIE1_ACTIE_SIZE                          equ 0001h
PIE1_ACTIE_LENGTH                        equ 0001h
PIE1_ACTIE_MASK                          equ 0008h
PIE1_CSWIE_POSN                          equ 0004h
PIE1_CSWIE_POSITION                      equ 0004h
PIE1_CSWIE_SIZE                          equ 0001h
PIE1_CSWIE_LENGTH                        equ 0001h
PIE1_CSWIE_MASK                          equ 0010h
PIE1_OSFIE_POSN                          equ 0005h
PIE1_OSFIE_POSITION                      equ 0005h
PIE1_OSFIE_SIZE                          equ 0001h
PIE1_OSFIE_LENGTH                        equ 0001h
PIE1_OSFIE_MASK                          equ 0020h
PIE1_TMR1IE_POSN                         equ 0006h
PIE1_TMR1IE_POSITION                     equ 0006h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0040h
PIE1_TMR1GIE_POSN                        equ 0007h
PIE1_TMR1GIE_POSITION                    equ 0007h
PIE1_TMR1GIE_SIZE                        equ 0001h
PIE1_TMR1GIE_LENGTH                      equ 0001h
PIE1_TMR1GIE_MASK                        equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0098h
// bitfield definitions
PIE2_TMR3IE_POSN                         equ 0000h
PIE2_TMR3IE_POSITION                     equ 0000h
PIE2_TMR3IE_SIZE                         equ 0001h
PIE2_TMR3IE_LENGTH                       equ 0001h
PIE2_TMR3IE_MASK                         equ 0001h
PIE2_TMR3GIE_POSN                        equ 0001h
PIE2_TMR3GIE_POSITION                    equ 0001h
PIE2_TMR3GIE_SIZE                        equ 0001h
PIE2_TMR3GIE_LENGTH                      equ 0001h
PIE2_TMR3GIE_MASK                        equ 0002h
PIE2_TMR2IE_POSN                         equ 0002h
PIE2_TMR2IE_POSITION                     equ 0002h
PIE2_TMR2IE_SIZE                         equ 0001h
PIE2_TMR2IE_LENGTH                       equ 0001h
PIE2_TMR2IE_MASK                         equ 0004h
PIE2_TMR4IE_POSN                         equ 0003h
PIE2_TMR4IE_POSITION                     equ 0003h
PIE2_TMR4IE_SIZE                         equ 0001h
PIE2_TMR4IE_LENGTH                       equ 0001h
PIE2_TMR4IE_MASK                         equ 0008h
PIE2_CCP1IE_POSN                         equ 0005h
PIE2_CCP1IE_POSITION                     equ 0005h
PIE2_CCP1IE_SIZE                         equ 0001h
PIE2_CCP1IE_LENGTH                       equ 0001h
PIE2_CCP1IE_MASK                         equ 0020h
PIE2_CCP2IE_POSN                         equ 0006h
PIE2_CCP2IE_POSITION                     equ 0006h
PIE2_CCP2IE_SIZE                         equ 0001h
PIE2_CCP2IE_LENGTH                       equ 0001h
PIE2_CCP2IE_MASK                         equ 0040h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0099h
// bitfield definitions
PIE3_PWM1PIE_POSN                        equ 0000h
PIE3_PWM1PIE_POSITION                    equ 0000h
PIE3_PWM1PIE_SIZE                        equ 0001h
PIE3_PWM1PIE_LENGTH                      equ 0001h
PIE3_PWM1PIE_MASK                        equ 0001h
PIE3_PWM1IE_POSN                         equ 0001h
PIE3_PWM1IE_POSITION                     equ 0001h
PIE3_PWM1IE_SIZE                         equ 0001h
PIE3_PWM1IE_LENGTH                       equ 0001h
PIE3_PWM1IE_MASK                         equ 0002h
PIE3_PWM2PIE_POSN                        equ 0002h
PIE3_PWM2PIE_POSITION                    equ 0002h
PIE3_PWM2PIE_SIZE                        equ 0001h
PIE3_PWM2PIE_LENGTH                      equ 0001h
PIE3_PWM2PIE_MASK                        equ 0004h
PIE3_PWM2IE_POSN                         equ 0003h
PIE3_PWM2IE_POSITION                     equ 0003h
PIE3_PWM2IE_SIZE                         equ 0001h
PIE3_PWM2IE_LENGTH                       equ 0001h
PIE3_PWM2IE_MASK                         equ 0008h

